emacs/init.el
;; -*- lexical-binding: t -*-
;; Please edit the Emacs.org file instead of this. Init.el is auto-generated.
(defvar reiki/default-font-size 130)
(defvar reiki/default-fixed-font "Liga SFMono Nerd Font")
(defvar reiki/default-variable-font "Iosevka Aile")

(setq inhibit-startup-screen t
      inhibit-startup-echo-area-message user-login-name)

(scroll-bar-mode -1)        ;Disable visible scrollbar
(tool-bar-mode -1)          ;Disable the toolbar
(menu-bar-mode -1)          ;Disable the menu bar
(tooltip-mode -1)           ;Disable tooltips
(set-fringe-mode 10)        ;Give some breathing room

(setq use-dialog-box nil)   ;Dont popup dialog-boxes when prompting

(setq visible-bell t)       ;Enables visual bell (turn off to hear sound. Unless we ignore it)
(setq ring-bell-function 'ignore) ;;BUT ignore it, to see and hear nothing

(save-place-mode 1)         ;Remember and restore cursor location

;; Line numbers (relative)
(column-number-mode)
(global-display-line-numbers-mode 1)
(setq display-line-numbers-type 'relative)
;; Explicitly define a width to reduce the cost of on-the-fly computation
(setq-default display-line-numbers-width 2) ; Change to 3 to view four digits

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                pdf-view-mode-hook
                doc-view-minor-mode
                tetris-mode-hook
                markdown-mode-hook
                dired-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Sets transparency (v29+)
(set-frame-parameter (selected-frame) 'alpha-background 95)
;; (add-to-list 'default-frame-alist 'alpha-background 95) ;; This screws up startup (besides, dont know what it does xD)

(set-face-attribute 'default nil
                    :font reiki/default-fixed-font
                    :height 130)

;; Set the fixed pitch face
(set-face-attribute 'fixed-pitch nil
                    :font reiki/default-fixed-font
                    :height 130)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil
                    :font reiki/default-variable-font
                    :height 130
                    :weight 'light)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Save what you enter into minibuffer
(setq history-length 25)
(savehist-mode 1)

;; Blank scratch buffer (almost)
(setq initial-scratch-message ";; Scratch buffer: YEET!")

;; Remember recently edited files
(recentf-mode 1)

;; Tabs!
(setq-default tab-width 2)
(setq-default indent-tabs-mode nil) ;Use spaces instead of tabs

;; Sentences end with one space
(setq sentence-end-double-space nil)

;; Contrary to what many Emacs users have in their configs, you don't need more
;; than this to make UTF-8 the default coding system:
(set-language-environment "UTF-8")
;; ...but 'set-language-environment' also sets 'default-input-method', which is
;; a step too opinionated.
(setq default-input-method nil)

;; When emacs asks for "yes" or "no", let "y" or "n" suffice
(setq use-short-answers t)

(setq blink-cursor-interval 0.6)
(blink-cursor-mode 10) ; Stops blinking after X, if 0 disable blinking
(setq-default cursor-in-non-selected-windows t) ; Hides cursor when nil if window loses focus

;; Smooth scrolling (kinda)
(setq scroll-margin 10)
(setq scroll-step 1)
(setq scroll-conservatively 101)

;; More performant rapid scrolling over unfontified regions. May cause brief
;; spells of inaccurate syntax highlighting right after scrolling, which should
;; quickly self-correct. 
(setq fast-but-imprecise-scrolling t)

;; Don't resize the frames in steps; it looks weird, especially in tiling window
;; managers, where it can leave unseemly gaps.
(setq frame-resize-pixelwise t)

;; But do not resize windows pixelwise, this can cause crashes in some cases
;; when resizing too many windows at once or rapidly.
(setq window-resize-pixelwise nil)

(setq native-comp-async-report-warnings-errors nil)

(defun reiki/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'reiki/display-startup-time)

;; Shave seconds off startup time by starting the scratch buffer in
;; `fundamental-mode', rather than, say, `org-mode' or `text-mode', which pull
;; in a ton of packages.
(setq initial-major-mode 'fundamental-mode)

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(setq use-package-verbose t)

;; Emacs29+
(setq package-native-compile t)

(use-package auto-package-update
  :defer t
  :custom
  (auto-package-update-interval 14)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "16:00"))
