emacs/Emacs.org
* Keybinding Configuration
This configuration uses evil-mode for a Vi-like modal editing experience. General.el is used for easy keybinding configuration that integrates well with which-key. Evil-collection is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

** General
[[https://github.com/noctuid/general.el][General.el]] is used for easy keybinding configuration that integrates well with which-key.

#+begin_src emacs-lisp

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general)

  (general-create-definer reiki/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (reiki/leader-keys
    "SPC" '(execute-extended-command :which-key "M-x")
    ;; Nav
    "." '(find-file :which-key "find file")
    "," '(consult-recent-file :which-key "recent files")
    ;; Buffers
    "q" '(kill-current-buffer :which-key "kill buff")
    "Q" '(save-buffers-kill-terminal :which-key "Quit emacs")
    "e" #'((lambda () (interactive) (find-file (locate-user-emacs-file "Emacs.org"))) :which-key "Emacs config")
    "j" #'((lambda () (interactive) (switch-to-buffer (other-buffer))) :which-key "Prev buff")
    )

  (reiki/leader-keys
    ;; "Applications"
    "a" '(:ignore a :which-key "Apps")
    "ad" '(dired-jump :which-key "Dired")
    ;; Hydra
    "s" '(:ignore s :which-key "Hydras")
    "ss" '(hydra-text-scale/body :which-key "Scale text")
    "st" '(hydra-theme-switcher/body :which-key "Choose theme")
    "sl" '(hydra-links/body :which-key "Links")
    ;; Buffers
    "b" '(:ignore b :which-key "Buffer")
    "bb" '(consult-buffer :which-key "Switch buffer")
    "br" '(revert-buffer :which-key "Revert buffer")
    "bs" '(save-buffer :which-key "Save buffer")
    "bk" '(kill-buffer :which-key "Kill buffer")
    ;; Org
    "o" '(:ignore o :which-key "Org")
    "oc" '(org-capture :which-key "Capture")
    "oh" '(consult-org-heading :which-key "Headings")
    "oa" '(org-agenda :which-key "Org agenda")
    "oe" '(org-export-dispatch :which-key "Org export")
    "op" '(org-present :which-key "Org present")
    ;; Help
    "h" '(:ignore h :which-key "Help/Emacs")
    "hm" '(evil-lookup :which-key "Manuals")
    "hv" '(describe-variable :which-key "Des. variable")
  ;; TODO: Find alternative to counsel
    "hb" '(counsel-descbinds :which-key "Des. bindings") ; Depends on counsel
    "hf" '(describe-function :which-key "Des. func")
    "hF" '(describe-face :which-key "Des. face")
    "hg" '(customize-group :which-key "Customize group")
    "hM" '(describe-mode :which-key "Des. mode")
    "hs" '(describe-symbol :which-key "Des. symbol")
    "hk" '(describe-key :which-key "Des. key")
    ;; Modes
    "m" '(:ignore m :which-key "Modes")
    "me" '(emacs-lisp-mode :which-key "Elisp mode")
    "mi" '(lisp-interaction-mode :which-key "Lisp interaction mode")
    "mo" '(org-mode :which-key "Org mode")
    "mt" '(text-mode :which-key "Text mode")
    ;; Help/emacs packages
    "hp" '(:ignore p :which-key "Packages")
    "hpr" '(package-refresh-contents :which-key "Refresh packages")
    "hpi" '(package-install :which-key "Install package")
    "hpd" '(package-delete :which-key "Delete package")
    "hpl" '(list-packages :which-key "List packages")
    "hpu" '(auto-package-update-now-async :which-key "Package update")
    ;; Toggles
    "t" '(:ignore t :which-key "Toggles")
    "tv" '(visual-line-mode :which-key "Visual line mode")
    "tm" '(minimap-mode :which-key "Minimap mode")
    "tn" '(display-line-numbers-mode :which-key "Display line numbers")
    "ta" '(variable-pitch-mode :which-key "Variable pitch mode")
    "tc" '(evilnc-comment-or-uncomment-lines :which-key "Comment line")
    "tf" '(visual-fill-column-mode :which-key "Visual fill column mode")
    "tR" '(read-only-mode :which-key "Read only mode")
    "tr" '(display-fill-column-indicator-mode :which-key "Fill column indicator")
    ;; Windows
    "w" '(:ignore w :which-key "Window")
    "wN" '(make-frame :which-key "New frame")
    "w|" '(split-window-right :which-key "Split right")
    "w-" '(split-window-below :which-key "Split below")
    "wd" '(evil-window-delete :which-key "delete window")
    "wl" '(evil-window-right :which-key "Move right")
    "wh" '(evil-window-left :which-key "Move left")
    "wj" '(evil-window-down :which-key "Move down")
    "wk" '(evil-window-up :which-key "Move up")
    )

#+end_src

** Evil
This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.
[[https://github.com/emacs-evil/evil-collection][Evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

#+begin_src emacs-lisp

  ;; Vim like modal editting
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-redo)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    ;;(define-key evil-motion-state-map "/" 'swiper) ; Replace normal search with swiper

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)


    ;; Setting cursor colors
    (setq evil-emacs-state-cursor    '("#ebcb8b" box))
    (setq evil-normal-state-cursor   '("#649bce" box))
    (setq evil-visual-state-cursor   '("#677691" box))
    (setq evil-operator-state-cursor '("#ebcb8b" hollow))
    (setq evil-insert-state-cursor '("#eb998b" (bar . 2)))
    (setq evil-replace-state-cursor  '("#eb998b" hbar))
    (setq evil-motion-state-cursor   '("#ad8beb" box))

    ;; Initial modes
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'motion)
    (evil-set-initial-state 'pdf-view-mode 'motion))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

** Hydra (and Text Scaling)
 [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp

    (use-package hydra
      :defer t)

    (defhydra hydra-text-scale (:timeout 4)
      "Scale text"
      ("j" text-scale-increase "in")
      ("k" text-scale-decrease "out")
      ("f" nil "finished"))

    (defhydra hydra-links (:timeout 4)
      "
      Links
      ----------------------------------------------
      _re_ r/Emacs         _g_ Github 
      _aw_ Emacswiki       _aw_ Archwiki
      _y_ Youtube          _n_ Netflix
      _q_ Quit                 ^
      ^                        ^
      "
      ("re" (browse-url "https://www.reddit.com/r/emacs/") "r/Emacs")
      ("ew" (browse-url "https://www.emacswiki.org/") "Emacswiki")
      ("aw" (browse-url "https://wiki.archlinux.org/") "Archwiki")
      ("y" (browse-url "https://www.youtube.com/") "Youtube")
      ("n" (browse-url "https://www.netflix.com/") "Netflix")
      ("g" (browse-url "https://github.com/Reikimann") "Github")
      ("q" nil "cancel"))

    (defhydra hydra-theme-switcher (:hint nil)
      "
         Dark                Light
    ----------------------------------------------
    _1_ Tokyo-Night      _z_ One-light 
    _2_ Palenight        _x_ Operandi
    _3_ Molokai          _c_ Tango
    _4_ Gruvbox          _v_ Whiteboard
    _5_ Dracula          _b_ Opera-light 
    _6_ Henna            _n_ Tomorrow-day 
    _q_ Quit             Current: %`custom-enabled-themes
    ^                        ^
    "
      ;; Dark
      ("1" (reiki/load-theme 'doom-tokyo-night) "Tokyo-night")
      ("2" (reiki/load-theme 'doom-palenight) "Palenight")
      ("3" (reiki/load-theme 'doom-molokai) "Molokai")
      ("4" (reiki/load-theme 'doom-gruvbox) "Gruvbox")
      ("5" (reiki/load-theme 'doom-dracula) "Dracula")
      ("6" (reiki/load-theme 'doom-henna) "Henna")

      ;; Light
      ("z" (reiki/load-theme 'doom-one-light) "One-light")
      ("x" (reiki/load-theme 'modus-operandi) "Modus-operandi")
      ("c" (reiki/load-theme 'doom-tango) "Tango")
      ("v" (reiki/load-theme 'whiteboard) "Whiteboard")
      ("b" (reiki/load-theme 'doom-opera-light) "Opera-light")
      ("n" (reiki/load-theme 'doom-tomorrow-day) "Tomorrow-day")
      ("q" nil))

#+end_src

* UI Configuration
