emacs/Emacs.org
** Command Log Mode
[[https://github.com/lewang/command-log-mode][Command-log-mode]] is useful for displaying a panel showing each key binding you use in a panel on the right side of the frame. Great for live streams and screencasts!

#+begin_src emacs-lisp

    (use-package command-log-mode
      :commands command-log-mode)

#+end_src
** Color Theme
[[https://github.com/hlissner/emacs-doom-themes][Doom-themes]] is a great set of themes with a lot of variety and support for many different Emacs modes.  Taking a look at the [[https://github.com/hlissner/emacs-doom-themes/tree/screenshots][screenshots]] might help you decide which one you like best.  You can also run =M-x counsel-load-theme= to choose between them easily.
#+begin_src emacs-lisp

  (use-package doom-themes
    :init
    (load-theme 'doom-tokyo-night t)
    (doom-themes-visual-bell-config))

#+end_src
** Better Modeline
[[https://github.com/seagle0128/doom-modeline][Doom-modeline]] is a very attractive and rich (yet still minimal) mode line configuration for Emacs.  The default configuration is quite good but you can check out the [[https://github.com/seagle0128/doom-modeline#customize][configuration options]] for more things you can enable or disable.

*NOTE:* The first time you load your configuration on a new machine, you'll need to run =M-x all-the-icons-install-fonts=, so that mode line icons display correctly.

#+begin_src emacs-lisp

  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 18))
    :config
    (setq doom-modeline-buffer-encoding nil 
          doom-modeline-buffer-file-name-style 'file-name ;; Just show file name (no path)
          doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode)
          doom-modeline-enable-word-count t
          doom-modeline-minor-modes t
          minions-mode 1
          doom-modeline-indent-info t ;; Whether display the indentation information.
          doom-modeline-major-mode-icon t
          ;doom-modeline-buffer-file-name-style 'truncate-except-project
          ))

  (use-package minions
    :after doom-modeline)

#+end_src

** Which Key
[[https://github.com/justbur/emacs-which-key][Which-key]] is a useful UI panel that appears when you start pressing any key binding in Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c= (hold control and press the letter =c=), a panel will appear at the bottom of the frame displaying all of the bindings under that prefix and which command they run.  This is very useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-prefix-prefix "◉")
    (setq which-key-idle-delay 0.2))

#+end_src

** Corfu

#+BEGIN_src emacs-lisp

  (use-package corfu
    :bind
    (:map corfu-map ("RET" . nil)) ;; Return key is for newline not completions 
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-auto t)                 ;; Enable auto completion
    (corfu-auto-delay 0.2)         ;; Seconds to wait before showing auto completion
    (corfu-on-exact-match nil)
    (corfu-auto-prefix 0)          ;; Minimum length before showing auto completion
    (corfu-count 10)               ;; Number of candidates to show
    (corfu-scroll-margin 5)        ;; Use scroll margin
    (corfu-popupinfo-hide nil)     ;; Hides docs between candidates
    (corfu-popupinfo-delay '0.1)     ;; Hides docs between candidates
    (corfu-popupinfo-max-width '40)
    (corfu-popupinfo-max-hight '10)
    (corfu-echo-mode nil)
    ;; Enable Corfu only for certain modes.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.
    ;; This is recommended since Dabbrev can be used globally (M-/).
    ;; See also `corfu-excluded-modes'.
    :config
    (define-key corfu-map (kbd "M-p") #'corfu-popupinfo-scroll-down)
    (define-key corfu-map (kbd "M-n") #'corfu-popupinfo-scroll-up)
    (define-key corfu-map (kbd "M-d") #'corfu-popupinfo-toggle)
    :init
    (corfu-popupinfo-mode)
    (corfu-history-mode)
    (global-corfu-mode))

#+end_src

** Vertico, Consult and marginalia
*** Vertico
#+begin_src emacs-lisp

  (use-package vertico
    :init
    (vertico-mode)

    :bind (:map vertico-map
           ("C-j" . vertico-next)
           ("C-k" . vertico-previous)
           :map minibuffer-local-map
           ("C-j" . next-line-or-history-element)
           ("C-k" . previous-line-or-history-element))

    :config
    (setq vertico-scroll-margin 4)
    (setq vertico-cycle t))

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (savehist-mode))

#+end_src
*** Marginalia
https://github.com/minad/marginalia
#+begin_src emacs-lisp

  ;; Enable rich annotations using the Marginalia package
  (use-package marginalia
    ;; Either bind `marginalia-cycle' globally or only in the minibuffer
    :bind (("M-A" . marginalia-cycle)
           :map minibuffer-local-map
           ("M-A" . marginalia-cycle))

    :custom
    (marginalia-max-relative-age 0)
    (marginalia-align 'right)
    ;; The :init configuration is always executed (Not lazy!)
    :init
    ;; Must be in the :init section of use-package such that the mode gets
    ;; enabled right away. Note that this forces loading the package.
    (marginalia-mode))

#+end_src
*** Consult
[[https://github.com/minad/consult][Consult]] 
#+begin_src emacs-lisp
  ;; Example configuration for Consult
  (use-package consult
    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)
    :config
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep consult-recent-file
     :preview-key (:debounce 0.4 any)
     consult-buffer :preview-key "C-l"
     )
  )

#+end_src
*** Orderless
https://github.com/oantolin/orderless
#+begin_src emacs-lisp

  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src
*** Embark
https://github.com/oantolin/embark
#+begin_src emacs-lisp

#+end_src
*** All The Icons Completion
Get the [[https://github.com/MintSoup/all-the-icons-completion][fork]] instead.
#+begin_src emacs-lisp

  (use-package all-the-icons
    :if (display-graphic-p))

  (use-package all-the-icons-completion
    :after (marginalia all-the-icons)
    :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
    :init
    (all-the-icons-completion-mode))

#+end_src
** Counsel, Ivy and Prescient
*** Counsel
Counsel is a customized set of commands to replace =find-file= with =counsel-find-file=, etc which provide useful commands for each of the default completion commands.

#+begin_src emacs-lisp

  ;; (use-package counsel
  ;;   :bind (
  ;;          ("M-x" . counsel-M-x)
  ;;          ("C-x C-f" . counsel-find-file)
  ;;          ("C-x b" . counsel-switch-buffer)
  ;;          )
  ;;          ;;("C-x b" . counsel-ibuffer)
  ;;          ;:map minibuffer-local-map
  ;;          ;("C-r" . 'counsel-minibuffer-history)
  ;;   :config 
  ;;   ;; Removes recentfiles/bookmarks from counsel-switch-buffer if set to nil
  ;;   (setq counsel-switch-buffer-preview-virtual-buffers t))

#+end_src

