emacs/Emacs.org
*** Ivy
[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs.  It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs.
 
[[https://github.com/Yevgnen/ivy-rich][Ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp

  ;; (use-package ivy
  ;;   :diminish
  ;;   :bind (("C-s" . swiper)
  ;;          :map ivy-minibuffer-map
  ;;          ("TAB" . ivy-alt-done)	
  ;;          ("C-l" . ivy-alt-done)
  ;;          ("C-j" . ivy-next-line)
  ;;          ("C-k" . ivy-previous-line)
  ;;          :map ivy-switch-buffer-map
  ;;          ("C-k" . ivy-previous-line)
  ;;          ("C-l" . ivy-done)
  ;;          ("C-d" . ivy-switch-buffer-kill)
  ;;          :map ivy-reverse-i-search-map
  ;;          ("C-k" . ivy-previous-line)
  ;;          ("C-d" . ivy-reverse-i-search-kill))
  ;;   :demand
  ;;   :config
  ;;   (setq ivy-extra-directories nil) ;; Hides . and .. directories
  ;;   (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
  ;;   (setq ivy-on-del-error-function #'ignore) ; Inhibits deletion closing the minibuffer
  ;;   (setq ivy-wrap t) ;; Wrap around to top, when on last item
  ;;   (ivy-mode 1)

  ;;   ;; Shows a preview of the face in counsel-describe-face
  ;;   (add-to-list 'ivy-format-functions-alist '(counsel-describe-face . counsel--faces-format-function)))

  ;; ;; Nice icons in Ivy. Replaces all-the-icons-ivy.
  ;; (use-package all-the-icons-ivy-rich
  ;;   :after ivy
  ;;   :init (all-the-icons-ivy-rich-mode 1)
  ;;   :config
  ;;   (setq all-the-icons-ivy-rich-icon-size 1.0))

  ;; (use-package ivy-rich
  ;;   :after ivy
  ;;   :init
  ;;   (setq ivy-rich-path-style 'abbrev)
  ;;   :config
  ;;   (ivy-rich-mode 1))

#+end_src

*** Prescient
#+begin_src emacs-lisp

  ;; (use-package ivy-prescient
  ;;   :disabled t
  ;;   :after counsel
  ;;   :config
  ;;   ;; don't prescient sort these commands
  ;;   (dolist (command '(counsel-find-file))
  ;;     (setq ivy-prescient-sort-commands (append ivy-prescient-sort-commands (list command))))
  ;;   ;(:not swiper swiper-isearch ivy-switch-buffer)
  ;;   (setq prescient-sort-length-enable nil) ; Disables sort by length
  ;;   (prescient-persist-mode 1)
  ;;   (ivy-prescient-mode 1))

#+end_src

** Helpful Help Commands
[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :commands (helpful-function helpful-variable helpful-macro helpful-callable helpful-key helpful-command helpful-at-point helpful-symbol)
    :bind
    ([remap describe-function] . helpful-function)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key))

#+end_src 
** Visuals
*** Kind Icons
#+begin_src emacs-lisp
  
  (use-package kind-icon
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

#+end_src

*** Minimap

#+begin_src emacs-lisp

  (use-package minimap
    :commands minimap-mode
    :config
    (setq minimap-window-location 'right)
    (setq minimap-minimum-width '20)
    (setq minimap-width-fraction '0.075)
    ;(add-to-list 'minimap-major-modes 'org-mode)
    )

#+End_src

* Org Mode
[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

