emacs/init.el
;;          :map ivy-minibuffer-map
;;          ("TAB" . ivy-alt-done)	
;;          ("C-l" . ivy-alt-done)
;;          ("C-j" . ivy-next-line)
;;          ("C-k" . ivy-previous-line)
;;          :map ivy-switch-buffer-map
;;          ("C-k" . ivy-previous-line)
;;          ("C-l" . ivy-done)
;;          ("C-d" . ivy-switch-buffer-kill)
;;          :map ivy-reverse-i-search-map
;;          ("C-k" . ivy-previous-line)
;;          ("C-d" . ivy-reverse-i-search-kill))
;;   :demand
;;   :config
;;   (setq ivy-extra-directories nil) ;; Hides . and .. directories
;;   (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
;;   (setq ivy-on-del-error-function #'ignore) ; Inhibits deletion closing the minibuffer
;;   (setq ivy-wrap t) ;; Wrap around to top, when on last item
;;   (ivy-mode 1)

;;   ;; Shows a preview of the face in counsel-describe-face
;;   (add-to-list 'ivy-format-functions-alist '(counsel-describe-face . counsel--faces-format-function)))

;; ;; Nice icons in Ivy. Replaces all-the-icons-ivy.
;; (use-package all-the-icons-ivy-rich
;;   :after ivy
;;   :init (all-the-icons-ivy-rich-mode 1)
;;   :config
;;   (setq all-the-icons-ivy-rich-icon-size 1.0))

;; (use-package ivy-rich
;;   :after ivy
;;   :init
;;   (setq ivy-rich-path-style 'abbrev)
;;   :config
;;   (ivy-rich-mode 1))

;; (use-package ivy-prescient
;;   :disabled t
;;   :after counsel
;;   :config
;;   ;; don't prescient sort these commands
;;   (dolist (command '(counsel-find-file))
;;     (setq ivy-prescient-sort-commands (append ivy-prescient-sort-commands (list command))))
;;   ;(:not swiper swiper-isearch ivy-switch-buffer)
;;   (setq prescient-sort-length-enable nil) ; Disables sort by length
;;   (prescient-persist-mode 1)
;;   (ivy-prescient-mode 1))

(use-package helpful
  :commands (helpful-function helpful-variable helpful-macro helpful-callable helpful-key helpful-command helpful-at-point helpful-symbol)
  :bind
  ([remap describe-function] . helpful-function)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-command] . helpful-command)
  ([remap describe-key] . helpful-key))

(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package minimap
  :commands minimap-mode
  :config
  (setq minimap-window-location 'right)
  (setq minimap-minimum-width '20)
  (setq minimap-width-fraction '0.075)
  ;(add-to-list 'minimap-major-modes 'org-mode)
  )
