emacs/Emacs.org
** Auto-show Markup Symbols
This package makes it much easier to edit Org documents, when =org-hide-emphasis-markers= is turned on. It temporarily shows the emphasis markers around certain markup elements, when you place your cursor inside of them.

#+begin_src emacs-lisp

  (use-package org-appear
    :hook (org-mode . org-appear-mode)
    :config
    ;; Appears only when in evil-insert-mode
    ;; (setq org-appear-trigger 'manual)
    ;; (add-hook 'org-mode-hook (lambda ()
    ;;                            (add-hook 'evil-insert-state-entry-hook
    ;;                                      #'org-appear-manual-start
    ;;                                      nil
    ;;                                      t)
    ;;                            (add-hook 'evil-insert-state-exit-hook
    ;;                                      #'org-appear-manual-stop
    ;;                                      nil
    ;;                                      t)))
    :custom
    (org-appear-autolinks 't))

#+end_src

** Org Babel
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use. [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][This page]] documents all of the languages that you can use with =org-babel=.
E.g type =<el= and press =<tab>= to make a elisp source block.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t))))

  (setq org-confirm-babel-evaluate nil)

  ;; Remember to figure out what this allows
  ;;(push '("conf-unix" . conf-unix) org-src-lang-modes)

  (with-eval-after-load 'org
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Org export

#+begin_src emacs-lisp

  (setq org-latex-compiler "lualatex")

#+end_src

** Org present

#+begin_src emacs-lisp

  (use-package org-present
    :defer
    :config
    (add-hook 'org-present-mode-hook 'reiki/org-present-start)
    (add-hook 'org-present-mode-quit-hook 'reiki/org-present-end)
    (add-hook 'org-present-after-navigate-functions 'reiki/org-present-prepare-slide)
    )

#+end_src

** Auto-tangle Configuration Files
This snippet adds a hook to =org-mode= buffers so that =reiki/org-babel-tangle-config= gets executed each time a buffer gets saved. This function checks to see if the file being saved is the =Emacs.org= file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp
  
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun reiki/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'reiki/org-babel-tangle-config)))

#+end_src

* Development
** Languages
*** IDE Features with lsp-mode
**** Lsp Mode
#+begin_src emacs-lisp

  (defun reiki/lsp-mode-setup ()
    (setq lsp-headerlined-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . reiki/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

#+end_src

**** Lsp UI
#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-enable nil)
    (setq lsp-ui-sideline-show-hover nil)
    :custom
    (setq lsp-ui-doc-enable t)
    (lsp-ui-doc-position 'bottom))

#+end_src

**** Lsp Treemacs
#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+end_src

** Treesitter

#+begin_src emacs-lisp

  (use-package tree-sitter
    :init
    (global-tree-sitter-mode)
    )

  (use-package tree-sitter-langs)

#+end_src

** Debugging with dap-mode
#+begin_src emacs-lisp

  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
    :commands dap-debug
    :config

    (general-define-key
      :keymaps 'lsp-mode-map
      :prefix lsp-keymap-prefix
      "d" '(dap-hydra t :wk "debugger")))

#+end_src
** Commenting

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :defer 0
    ;:bind ("M-/" . evilnc-comment-or-uncomment-lines)
    )

#+end_src

** Projectile
#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    ;; :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/coding")
      (setq projectile-project-search-path '("~/coding")))
    (setq projectile-switch-project-action #'projectile-dired))

#+end_src

** Magit
#+begin_src emacs-lisp

    (use-package magit
      :commands magit-status)

#+end_src
#+end_src
** Rainbow Delimiters

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** Smart Parens
Do =M-x sp-cheat-sheet= to show all available commands with examples.

#+begin_src emacs-lisp

  (use-package smartparens
    :defer 0
    ;; :hook (prog-mode . smartparens-mode)
    :init (smartparens-mode))

#+end_src

** Latex
Following text is a comment from a [[https://www.youtube.com/watch?v=SCPoF1PTZpI&lc=Ugy3MSK67MeOzJDldpZ4AaABAg.9coz1zr2syn9cq0F64cbz2][System Crafters Video]]:

Depending on your workflow another method of typing LaTeX is AucTex and Org Latex Preview which allows you to display LaTeX within an Org document without having to split the window into two panes and use Org-LaTex-Export to generate a PDF in the end if you need it. Org Fragtog is a must if you go in this direction. 

Personally I enjoy this second method more due to the LaTeX being held within Org meaning you can use a lot of the power of Org Mode with your LaTeX documents. E.g. Turn Math definitions into Flashcards with Org-FC, Create mindmaps / graphs of theorems using Org-Roam, turn your personal notes into a website blog post using Org HTML export etc.

*** AucTex

#+begin_src emacs-lisp

  (use-package tex
    :mode ("\\.tex\\'" . latex-mode)
    ;; :defer t
    :ensure auctex
    :config
    (setq TeX-ignore-warnings t
          latex-run-command "latexmk" ;TODO: change to latexmk
          tex-directory (concat user-emacs-directory "tex-tmp")

          TeX-parse-self t ; parse on load
          TeX-auto-save t  ; parse on save

          ;; Use directories in a hidden away folder for AUCTeX files.
          Tex-auto-local (concat user-emacs-directory "auctex/auto/")
          Tex-style-local (concat user-emacs-directory "auctex/style/")

          Tex-source-correlate-mode t
          Tex-source-correlate-method 'synctex

          TeX-show-compilation nil

          ;; Don't start the Emacs server when correlating sources.
          TeX-source-correlate-start-server nil

          ;; Automatically insert braces after sub/superscript in `LaTeX-math-mode'.
          TeX-electric-sub-and-superscript t
          ;; Just save, don't ask before each compilation.
          TeX-save-query nil)

    ;; To use pdfview with auctex:
    (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
          TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
          TeX-source-correlate-start-server t)

    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
    (add-hook 'TeX-after-compilation-finished-functions (lambda (filename) (shell-command "latexmk -silent -c")))

    :general
    (general-define-key
     :prefix ","
     :states 'normal
     :keymaps 'LaTeX-mode-map
     "" nil
     "a" '(TeX-command-run-all :which-key "TeX run all")
     "c" '(TeX-command-master :which-key "TeX-command-master")
     "e" '(LaTeX-environment :which-key "Insert environment")
     "s" '(LaTeX-section :which-key "Insert section")
     "m" '(TeX-insert-macro :which-key "Insert macro")
     )
    )

#+end_src

*** Fragtog
[[https://github.com/io12/org-fragtog#org-fragtog][Org fragtog]] automatically toggles Org mode LaTeX fragment previews as the cursor enters and exits them

#+begin_src emacs-lisp

  (use-package org-fragtog
    :hook (org-mode . org-fragtog-mode)
    :config
    (setq org-fragtog-preview-delay 0.3)
    )

#+end_src

** Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode ("\\.md\\'" . markdown-mode)
    :ensure nil
    :config
    (add-hook 'markdown-mode-hook #'reiki/visual-fill)
    (add-hook 'markdown-mode-hook #'visual-line-mode)
    (dolist (face '((markdown-header-face-1 . 1.2)
                    (markdown-header-face-2 . 1.1)
                    (markdown-header-face-3 . 1.05)
                    (markdown-header-face-4 . 1.0)
                    (markdown-header-face-5 . 1.0)))
      (set-face-attribute (car face) 'unspecified :weight 'normal :height (cdr face)))
  )
#+end_src

