emacs/Emacs.org
** PDF Tools
[[https://github.com/politza/pdf-tools][PDF-tools]] is among other things a replacement for DocView for PDF files. Crashed may occur when linum-mode is installed.

Arch packages required:
- libpng
- zlib
- poppler-glib
- imagemagick

#+begin_src emacs-lisp

  (use-package pdf-tools
    :init
    (pdf-loader-install)
    :config
    (setq-default pdf-view-display-size 'fit-height)
    (setq pdf-view-continous nil)
    (setq pdf-view-midnight-colors '("#ffffff" . "#121212" ))
    :general
    (general-define-key :states 'motion :keymaps 'pdf-view-mode-map
                        "j" 'pdf-view-next-page
                        "k" 'pdf-view-previous-page

                        "C-j" 'pdf-view-next-line-or-next-page
                        "C-k" 'pdf-view-previous-line-or-previous-page

                        "H" 'pdf-view-fit-height-to-window
                        "0" 'pdf-view-fit-height-to-window
                        "W" 'pdf-view-fit-width-to-window
                        "K" 'pdf-view-enlarge
                        "J" 'pdf-view-shrink

                        "q" 'kill-this-buffer
                        "g" 'revert-buffer

                        ;; Arrows for movement as well
                        (kbd "<down>") 'pdf-view-next-line-or-next-page
                        (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                        (kbd "<down>") 'pdf-view-next-line-or-next-page
                        (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                        (kbd "<left>") 'image-backward-hscroll
                        (kbd "<right>") 'image-forward-hscroll
                        ))

#+end_src

* System Cleanup
Stops hidden files, created by Emacs, cluttering your system.

#+begin_src emacs-lisp

  ;; Moves backups to specified directory
  (setq backup-directory-alist `(("." . , (expand-file-name "tmp/backups/" user-emacs-directory))))

  ;; auto-save-mode doesn't create4 the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  (setq create-lockfiles nil)

#+end_src
* Fun
** Games
- Tetris
#+begin_src emacs-lisp
  (use-package tetris
    :ensure nil
    :defer t
    :config
    (evil-collection-tetris-setup)
    )
#+end_src

** Chat
*** ERC
*** Elfeed

#+begin_src emacs-lisp

  (use-package elfeed
    :commands 'elfeed
    :config
    (setq elfeed-search-filter "@3-months-ago +unread")
    (setq elfeed-db-directory (concat user-emacs-directory "elfeed/"))
    (setq elfeed-enclosure-default-dir (concat user-emacs-directory "elfeed/"))
    (setq elfeed-feeds
          '("https://archlinux.org/feeds/news"
            "https://www.reddit.com/r/emacs/.rss")))

#+end_src

* Built-in Packages
** Eshell

#+begin_src emacs-lisp

    ;(setenv "BASH_ENV" "~/.bashrc")
    (defun reiki/configure-eshell ()
      ;; Save command history when commands are entered
      (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

      ;; Truncate buffer for performance
      (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

      ;; Bind some useful keys for evil-mode
      (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
      (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
      (evil-normalize-keymaps)

      (setq eshell-history-size         10000
            eshell-buffer-maximum-lines 10000
            eshell-hist-ignoredups t
            eshell-scroll-to-bottom-on-input t))

    (use-package eshell-git-prompt
      :after eshell)

    (use-package eshell
      :hook (eshell-first-time-mode . reiki/configure-eshell)
      :config
      (with-eval-after-load 'esh-opt
        (setq eshell-destroy-buffer-when-process-dies t)
        (setq eshell-visual-commands '("htop" "zsh" "vim")))

      (eshell-git-prompt-use-theme 'powerline))

#+end_src

** DocView
Loads DocView pages continuously.

#+begin_src emacs-lisp

  ;; View all pages in DocView-mode
  (setq doc-view-continuous t)

#+end_src
** Dired
Dired is a built-in file manager for Emacs that does some pretty amazing things! Here are some key bindings you should try out:

*** Key Bindings
**** Navigation
*Emacs* / *Evil*
- =n= / =j= - next line
- =p= / =k= - previous line
- =j= / =J= - jump to file in buffer
- =RET= - select file or directory
- =^= - go to parent directory
- =S-RET= / =g O= - Open file in "other" window
- =M-RET= - Show file in other window without focusing (previewing files)
- =g o= (=dired-view-file=) - Open file but in a "preview" mode, close with =q=
- =g= / =g r= Refresh the buffer with =revert-buffer= after changing configuration (and after filesystem changes!)

**** Marking files
- =m= - Marks a file
- =u= - Unmarks a file
- =U= - Unmarks all files in buffer
- =* t= / =t= - Inverts marked files in buffer
- =% m= - Mark files in buffer using regular expression
- =*= - Lots of other auto-marking functions
- =k= / =K= - "Kill" marked items (refresh buffer with =g= / =g r= to get them back)
- Many operations can be done on a single file if there are no active marks!
 
**** Copying and Renaming files
- =C= - Copy marked files (or if no files are marked, the current file)
- Copying single and multiple files
- =U= - Unmark all files in buffer
- =R= - Rename marked files, renaming multiple is a move!
- =% R= - Rename based on regular expression: =^test= , =old-\&=

*Power command*: =C-x C-q= (=dired-toggle-read-only=) - Makes all file names in the buffer editable directly to rename them!  Press =Z Z= to confirm renaming or =Z Q= to abort.

**** Deleting files
- =D= - Delete marked file
- =d= - Mark file for deletion
- =x= - Execute deletion for marks
- =delete-by-moving-to-trash= - Move to trash instead of deleting permanently

**** Creating and extracting archives
- =Z= - Compress or uncompress a file or folder to (=.tar.gz=)
- =c= - Compress selection to a specific file
- =dired-compress-files-alist= - Bind compression commands to file extension

**** Other common operations
- =T= - Touch (change timestamp)
- =M= - Change file mode
- =O= - Change file owner
- =G= - Change file group
- =S= - Create a symbolic link to this file
- =L= - Load an Emacs Lisp file into Emacs

*** Configuration

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho -A --group-directories-first"))
    :config
    (setq dired-kill-when-opening-new-dired-buffer t)
    ;; TODO: Figure out how this works
    ;; (setq dired-guess-shell-alist-user '(
    ;;                                      ;; ("\\.pdf\\'" "zathura")
    ;;                                      ("\\.doc\\'" "libreoffice")
    ;;                                      ("\\.docx\\'" "libreoffice")
    ;;                                      ("\\.ppt\\'" "libreoffice")
    ;;                                      ("\\.pptx\\'" "libreoffice")
    ;;                                      ("\\.xls\\'" "libreoffice")
    ;;                                      ("\\.xlsx\\'" "libreoffice")
    ;;                                      ("\\.jpg\\'" "nsxiv")
    ;;                                      ("\\.png\\'" "nsxiv")))
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))

  (use-package diredfl
    :hook (dired-mode . diredfl-mode))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode)
    :config
    (setq all-the-icons-dired-monochrome nil))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src

