emacs/init.el

(use-package pdf-tools
  :init
  (pdf-loader-install)
  :config
  (setq-default pdf-view-display-size 'fit-height)
  (setq pdf-view-continous nil)
  (setq pdf-view-midnight-colors '("#ffffff" . "#121212" ))
  :general
  (general-define-key :states 'motion :keymaps 'pdf-view-mode-map
                      "j" 'pdf-view-next-page
                      "k" 'pdf-view-previous-page

                      "C-j" 'pdf-view-next-line-or-next-page
                      "C-k" 'pdf-view-previous-line-or-previous-page

                      "H" 'pdf-view-fit-height-to-window
                      "0" 'pdf-view-fit-height-to-window
                      "W" 'pdf-view-fit-width-to-window
                      "K" 'pdf-view-enlarge
                      "J" 'pdf-view-shrink

                      "q" 'kill-this-buffer
                      "g" 'revert-buffer

                      ;; Arrows for movement as well
                      (kbd "<down>") 'pdf-view-next-line-or-next-page
                      (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                      (kbd "<down>") 'pdf-view-next-line-or-next-page
                      (kbd "<up>") 'pdf-view-previous-line-or-previous-page

                      (kbd "<left>") 'image-backward-hscroll
                      (kbd "<right>") 'image-forward-hscroll
                      ))

;; Moves backups to specified directory
(setq backup-directory-alist `(("." . , (expand-file-name "tmp/backups/" user-emacs-directory))))

;; auto-save-mode doesn't create4 the path automatically!
(make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

(setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

(setq create-lockfiles nil)

(use-package tetris
  :ensure nil
  :defer t
  :config
  (evil-collection-tetris-setup)
  )

(use-package elfeed
  :commands 'elfeed
  :config
  (setq elfeed-search-filter "@3-months-ago +unread")
  (setq elfeed-db-directory (concat user-emacs-directory "elfeed/"))
  (setq elfeed-enclosure-default-dir (concat user-emacs-directory "elfeed/"))
  (setq elfeed-feeds
        '("https://archlinux.org/feeds/news"
          "https://www.reddit.com/r/emacs/.rss")))

;(setenv "BASH_ENV" "~/.bashrc")
(defun reiki/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . reiki/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))

  (eshell-git-prompt-use-theme 'powerline))

;; View all pages in DocView-mode
(setq doc-view-continuous t)

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom ((dired-listing-switches "-agho -A --group-directories-first"))
  :config
  (setq dired-kill-when-opening-new-dired-buffer t)
  ;; TODO: Figure out how this works
  ;; (setq dired-guess-shell-alist-user '(
  ;;                                      ;; ("\\.pdf\\'" "zathura")
  ;;                                      ("\\.doc\\'" "libreoffice")
  ;;                                      ("\\.docx\\'" "libreoffice")
  ;;                                      ("\\.ppt\\'" "libreoffice")
  ;;                                      ("\\.pptx\\'" "libreoffice")
  ;;                                      ("\\.xls\\'" "libreoffice")
  ;;                                      ("\\.xlsx\\'" "libreoffice")
  ;;                                      ("\\.jpg\\'" "nsxiv")
  ;;                                      ("\\.png\\'" "nsxiv")))
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-up-directory
    "l" 'dired-find-file))

(use-package diredfl
  :hook (dired-mode . diredfl-mode))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  :config
  (setq all-the-icons-dired-monochrome nil))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))
