emacs/Emacs.org
* Custom Functions

#+begin_src emacs-lisp

  (defun reiki/load-theme (theme)
    "Enhance `load-theme' by first disabling enabled themes."
    (mapc #'disable-theme custom-enabled-themes)
    (load-theme theme t))


  ;;; Org-present-functions

  (defun reiki/org-present-start ()
    "Sets options to enhance look for org-present."
    ;; Set a blank header line string to create blank space at the top
    (setq header-line-format " ")

    ;; Display inline images automatically
    (org-display-inline-images)

    (org-appear-mode -1)

    (evil-define-key '(normal) org-present-mode-keymap (kbd "w") 'evil-forward-word-begin)
    (evil-define-key '(normal) org-present-mode-keymap (kbd "j") 'evil-next-visual-line)
    (evil-define-key '(normal) org-present-mode-keymap (kbd "k") 'evil-previous-visual-line)
    (evil-define-key '(normal) org-present-mode-keymap (kbd "C-k") 'org-present-prev)
    (evil-define-key '(normal) org-present-mode-keymap (kbd "C-j") 'org-present-next)

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      (set-face-attribute (car face) nil :font reiki/default-variable-font :weight 'medium :height (cdr face)))

    ;; Tweak font sizes
    (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                       (header-line (:height 4.0) variable-pitch)
                                       (org-document-title (:height 1.75) org-document-title)
                                       (org-code (:height 1.55) org-code)
                                       (org-verbatim (:height 1.55) org-verbatim)
                                       (org-block (:height 1.25) org-block)
                                       (org-block-begin-line (:height 0.7) org-block))))

  (defun reiki/org-present-end ()
    "Disables unneeded options set by reiki/org-present-start."
    ;; Clear the header line format by setting to `nil'
    (setq header-line-format nil)

    ;; Stop displaying inline images
    (org-remove-inline-images)

    (org-appear-mode)

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      (set-face-attribute (car face) nil :font reiki/default-fixed-font :weight 'medium :height (cdr face)))

    ;; Reset font customizations
    (setq-local face-remapping-alist '((default default default))))

  (defun reiki/org-present-prepare-slide (buffer-name heading)
    "Enhances legibility and overview in org-present"
    ;; Show only top-level headlines
    (org-overview)

    ;; Unfold the current entry
    (org-show-entry)

    ;; Show only direct subheadings of the slide but don't expand them
    (org-show-children))

    ;;; End of Org-present-functions

#+end_src

* Runtime Performance

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp

  ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src
